# Завдання:
# Заповніть функцію saleHotdogs/ SaleHotDogs/ sale_hotdogs, функція приймає 1 параметр: n, n – кількість хот-догів,
# яку купить клієнт, різні кількості мають різні ціни (див. наступну таблицю),
# повертає, скільки грошей клієнт витратить, щоб купити таку кількість хот-догів.
# кількість хот-догів	ціна за одиницю (центи)
# n < 5	100
# n >= 5 та n < 10	95
# n >= 10	90
# Ви можете використовувати if..else або тернарний оператор для його завершення.

def sale_hotdogs(n):
    return n * (100 if n <5 else 95 if n <10 else 90)
print(sale_hotdogs(10))
