Музей неймовірно нудних речей

Музей неймовірно нудних речей хоче позбутися деяких експонатів. Міріам, архітекторка інтер'єру, придумує план, як прибрати найнудніші експонати. Вона виставляє їм оцінки, а потім прибирає той, що має найнижчу оцінку.

Однак, як тільки вона закінчила оцінювати всі експонати, вона вирушає на важливий ярмарок, тому вона просить вас написати програму, яка повідомить їй рейтинг експонатів після видалення найнижчого. Достатньо справедливо.
Задача

За заданим масивом цілих чисел видалити найменше значення. Вихідний масив/список не мутувати. Якщо є декілька елементів з однаковим значенням, видаліть елемент з найменшим індексом. Якщо ви отримуєте порожній масив/список, поверніть порожній масив/список.

Не змінюйте порядок елементів, що залишилися.
Приклади

* Вхідні дані: [1,2,3,4,5], вивести = [2,3,4,5]
* Вхідні дані: [5,3,2,1,4], output = [5,3,2,4]
* Вхідні дані: [2,2,1,2,1], output = [2,2,2,1]