# 1
# The Guessing Game

import random

print("""           ГРА 'ВГАДАЙ ЧИСЛО'           """)
user_name = input('Як тебе звати: ')  #
print(f'Привіт, {user_name}! Ти маєш вгадати число від 1 до 10.')
# застосовую цикл, ідея в тому, що користувач не має
# перезапускати гру вручну
while True:
    player = input("Додай обране число сюди. Щоб зупинити гру, "
                   "напиши СТОП: ").lower().strip()
    # обрізаю пробіли та переводжу в нижній регістр для виконання
    # наступної умови циклу:

    if player == 'стоп':
        print("Гра завершена. Дякую за участь!")
        break
    # перевірка типу введених даних
    if not player.isdigit():
        print('Можна вводити лише число!')
        continue
    # вивід обраного числа, для візуалізації
    player = int(player)
    print(f'Ти обрав число {player}!')
    # змінна laptop виводить випадкові числа у діапазоні 1-10
    laptop = random.randint(1, 10)

    if player != laptop:
        print(f'Ти програв! Загадане число: {laptop}, твоє число: {player}')
    else:
        print(f'Ти вгадав! Загадане число: {laptop}, твоє число: {player}')

# 2
# довелось використовувати подвійні лапки через апостроф в укр.мові
name = input("Напиши своє ім'я: ")

while True:
    age = input("Скільки тобі років? Напиши тут число: ")

    if not age.isdigit():  # перевірка чи введене значення числове
        print("Напиши свій вік числами!")
        continue  # повторення циклу поки не буде введене коректне значення

    age = int(age)
    print(f'Привіт, {name}! У твій наступний День народження тобі буде {age + 1} років!')
    break  # ззавершення циклу

# 3

import random

# тут не зовсім зрозуміло, адже я уже його імпортував на початку файлу,
# мабуть він і так працює. Але для перестраховки імпортував ще раз.

user_input = input("Додайте текст: ")

# перетворюю введене на список
letters = list(user_input)

for _ in range(5):
    # міксую елементи списку методом .suffle (порада від GPT)
    random.shuffle(letters)
    # склеюю докупи перемішані символи
    shuffled_word = ''.join(letters)
    print(shuffled_word)
