# Напишіть функцію, яка приймає два числа від користувача за допомогою input(),
# називає ці числа a і b, а потім повертає значення квадрата a, поділеного на b.
# Створіть блок try-except, який виловлює виняток, якщо два значення, надані функцією input,
# не були числами, а значення b було нулем (не можна ділити на нуль).

def calculate ():
    # ТІЛО ФУНКЦІЇ
    try:
        a = float(
            input('Додайте значення для піднесення в квадрат: ').replace(',', '.')
                  )
        b = float(
            input('Додайте дільник: ').replace(',', '.')
                  )
        result = (a**2)/b
    # БЛОК ВИКЛЮЧЕНЬ
    except (ValueError, TypeError):
        print(
            'Неправильний тип даних!'
            ' Вводьте лише числа!'
        )
    except ZeroDivisionError:
        print(
            'Ділити на нуль не можна!'
        )
    else:
        print(
            'Результат обчислень: ', result
        )

calculate ()